In [1]:
import pandas as pd
import numpy as np

In [2]:
list('ABC')

['A', 'B', 'C']

In [3]:
g = np.random.default_rng(0)
df = pd.DataFrame(g.integers(0, 100, [36, 3]), columns=list('ABC'))
df['year'] = [2018] * 12 + [2019] * 12 + [2020] * 12
df['month'] = ' Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec'.split() * 3

In [4]:
df.head()

    A   B   C  year month
0  85  63  51  2018   Jan
1  26  30   4  2018   Feb
2   7   1  17  2018   Mar
3  81  64  91  2018   Apr
4  50  60  97  2018   May

In [5]:
df = df.set_index(['year', 'month'])
df.head(15)

             A   B   C
year month
2018 Jan    85  63  51
     Feb    26  30   4
     Mar     7   1  17
     Apr    81  64  91
     May    50  60  97
     Jun    72  63  54
     Jul    55  93  27
     Aug    81  67   0
     Sep    39  85  55
     Oct     3  76  72
     Nov    84  17   8
     Dec    86   2  54
2019 Jan     8  29  48
     Feb    42  40   2
     Mar     0  12   0

In [6]:
df.loc[2020]

        A   B   C
month
Jan    42  48  71
Feb    88   7  93
Mar    53  35  67
Apr    57  25  32
May    71  59  50
Jun    33  76  39
Jul    32  89  26
Aug    22  71  62
Sep     4   8  37
Oct    83  40  78
Nov    31  23  79
Dec    87   7   5

In [7]:
df.loc[(2018, ['A', 'B'])]

        A   B
month
Jan    85  63
Feb    26  30
Mar     7   1
Apr    81  64
May    50  60
Jun    72  63
Jul    55  93
Aug    81  67
Sep    39  85
Oct     3  76
Nov    84  17
Dec    86   2

In [8]:
df.loc[(2018, 'Jun'), ['A', 'C']]

A    72
C    54
Name: (2018, Jun), dtype: int64

In [9]:
df.loc[[2018, 2019], ['B', 'C']]

             B   C
year month
2018 Jan    63  51
     Feb    30   4
     Mar     1  17
     Apr    64  91
     May    60  97
     Jun    63  54
     Jul    93  27
     Aug    67   0
     Sep    85  55
     Oct    76  72
     Nov    17   8
     Dec     2  54
2019 Jan    29  48
     Feb    40   2
     Mar    12   0
     Apr    52  64
     May    61  76
     Jun    46  99
     Jul    98  37
     Aug    95  65
     Sep    68  70
     Oct    87  13
     Nov    72  84
     Dec    37  31

In [10]:
df.loc[[(2020, 'Jun'), (2019, 'Jun')]]

             A   B   C
year month
2020 Jun    33  76  39
2019 Jun    38  46  99

In [11]:
df.loc[([2018, 2019, 2020], ['Jan', 'Jun', 'Sep']), 'A':'C']

             A   B   C
year month
2018 Jan    85  63  51
     Jun    72  63  54
     Sep    39  85  55
2019 Jan     8  29  48
     Jun    38  46  99
     Sep    84  68  70
2020 Jan    42  48  71
     Jun    33  76  39
     Sep     4   8  37

In [12]:
df = pd.read_csv('../data_sets/sat-scores.csv', 
                 usecols=['Year', 'State.Code', 'Total.Math', 'Total.Test-takers', 'Total.Verbal' ])
df.head()

   Year State.Code  Total.Math  Total.Test-takers  Total.Verbal
0  2005         AL         559               3985           567
1  2005         AK         519               3996           523
2  2005         AZ         530              18184           526
3  2005         AR         552               1600           563
4  2005         CA         522             186552           504

In [13]:
df = df.set_index(['Year', 'State.Code'])

In [14]:
df.loc[(2005), 'Total.Test-takers'].sum()

1344824

In [15]:
df.loc[2005, 'Total.Test-takers' ].sum()

1344824

In [19]:
df.loc[[(2010,'NJ'), (2010, 'NY'), (2010, 'MA'), (2010, 'IL')], 'Total.Math'].mean()

535.25

In [17]:
df.loc[([2012, 2013, 2014, 2015], ['AZ', 'CA', 'TX']), 'Total.Verbal'].mean()

497.3333333333333

# Beyond 1
### What were the average math and verbal scores for Florida, Indiana, and Idaho
### across all years? (Don’t break out the values by state.)

In [24]:
df.loc[(slice(None), ['FL', 'IN', 'ID']), ['Total.Math', 'Total.Verbal']].mean()

Total.Math      507.090909
Total.Verbal    504.606061
dtype: float64

# Beyond 2
### Which state received the highest verbal score, and in which year?

In [37]:
df.loc[df['Total.Verbal'] == df['Total.Verbal'].max(), 'Total.Verbal']

Year  State.Code
2013  ND            612
Name: Total.Verbal, dtype: int64

# Beyond 3
### Was the average math score in 2005 higher or lower than that in 2015?

In [39]:
df.loc[(2005), 'Total.Math'].mean() < df.loc[(2015), 'Total.Math'].mean()

False

### Yes, average math score was higher in 2005 than in 2015.